Revit 2027 API
NavisworksExportOptions.Coordinates Property
 Options which specifies the coordinates of Navisworks Exporter. Default value is Shared.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NavisworksCoordinates Coordinates { get; set; }
Public Property Coordinates As NavisworksCoordinates
	Get
	Set
public:
property NavisworksCoordinates Coordinates {
	NavisworksCoordinates get ();
	void set (NavisworksCoordinates value);
}
member Coordinates : NavisworksCoordinates with get, set
Property Value
NavisworksCoordinates
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace